[
  {
    "Name": "Wontons",
    "ImageUrl": "https://www.themealdb.com/images/media/meals/1525876468.jpg",
    "Ingredients": [
      "Pork",
      "Garlic Clove",
      "Ginger",
      "Soy Sauce",
      "Sesame Seed Oil",
      "Carrots",
      "Celery",
      "Spring Onions",
      "Wonton Skin",
      "Oil",
      "Water"
    ],
    "Instructions": "Combine pork, garlic, ginger, soy sauce, sesame oil, and vegetables in a bowl.\r\nSeparate wonton skins.\r\nPlace a heaping teaspoon of filling in the center of the wonton.\r\nBrush water on 2 borders of the skin, covering 1/4 inch from the edge.\r\nFold skin over to form a triangle, sealing edges.\r\nPinch the two long outside points together.\r\nHeat oil to 450 degrees and fry 4 to 5 at a time until golden.\r\nDrain and serve with sauce."
  },
  {
    "Name": "Kumpir",
    "ImageUrl": "https://www.themealdb.com/images/media/meals/mlchx21564916997.jpg",
    "Ingredients": [
      "Potatoes",
      "Butter",
      "Cheese",
      "Onion",
      "Red Pepper",
      "Red Chile Flakes"
    ],
    "Instructions": "If you order kumpir in Turkey, the standard filling is first, lots of butter mashed into the potato, followed by cheese. There’s then a row of other toppings that you can just point at to your heart’s content – sweetcorn, olives, salami, coleslaw, Russian salad, allsorts – and you walk away with an over-stuffed potato because you got ever-excited by the choices on offer.\r\n\r\nGrate (roughly – you can use as much as you like) 150g of cheese.\r\nFinely chop one onion and one sweet red pepper.\r\nPut these ingredients into a large bowl with a good sprinkling of salt and pepper, chilli flakes (optional)."
  },
  {
    "Name": "Kapsalon",
    "ImageUrl": "https://www.themealdb.com/images/media/meals/sxysrt1468240488.jpg",
    "Ingredients": [
      "Fries",
      "Doner Meat",
      "Garlic sauce",
      "Hotsauce",
      "Lettuce",
      "Tomato",
      "Cucumber",
      "Gouda cheese"
    ],
    "Instructions": "Cut the meat into strips. Heat oil in a pan and fry the strips for 6 minutes until it\u0027s ready.\r\nBake the fries until golden brown in a deep fryrer. When ready transfer to a backing dish. Make sure the fries are spread over the whole dish.\r\nCover the fries with a new layer of meat and spread evenly.\r\nAdd a layer of cheese over the meat. You can also use grated cheese. When done put in the oven for a few minutes until the cheese is melted.\r\nChop the lettuce, tomato and cucumber in small pieces and mix together. for a basic salad. As extra you can add olives jalapenos and a red union.\r\nDived the salad over the dish and Serve with garlicsauce and hot sauce"
  },
  {
    "Name": "Pancakes",
    "ImageUrl": "https://www.themealdb.com/images/media/meals/rwuyqx1511383174.jpg",
    "Ingredients": [
      "Flour",
      "Eggs",
      "Milk",
      "Sunflower Oil",
      "Sugar",
      "Raspberries",
      "Blueberries"
    ],
    "Instructions": "Put the flour, eggs, milk, 1 tbsp oil and a pinch of salt into a bowl or large jug, then whisk to a smooth batter. Set aside for 30 mins to rest if you have time, or start cooking straight away.\r\nSet a medium frying pan or crêpe pan over a medium heat and carefully wipe it with some oiled kitchen paper. When hot, cook your pancakes for 1 min on each side until golden, keeping them warm in a low oven as you go.\r\nServe with lemon wedges and sugar, or your favourite filling. Once cold, you can layer the pancakes between baking parchment, then wrap in cling film and freeze for up to 2 months."
  }
]